---
type: GroupSetIterator
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# GroupSetIterator

`Autodesk.Revit.DB.GroupSetIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | GroupSetIterator | — | `public GroupSetIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |